#include <stdio.h>

void main() {
/*
	교재 - C로 배우는 쉬운 자료구조

	사전 요망사항
	- 간단한 수학공식들을 참조할 때 이해 (ex. 로그함수, 지수함수, 수열의 합, 방정식의 그래프 표현)
	- C 언어를 구사할 수 있어야 함
	- 데이터 표현 및 저장 방식에 대한 이해
	- 컴퓨터 구조(CPU, Register, 보조기억장치 등)에 대한 이해

	자료 구조란?
	-컴퓨터 내부의 2진수 코드 체계
	-자료 형태에 따른 자료 표현 형식
	-자료 연결리스트, 큐, 스택, 트리, 그래프
	-자료 정렬, 검색
	-알고리즘의 개념과 성능분석 방법

	알고리즘의 예시
	 * 1부터 10까지의 숫자를 생각하였고 그 숫자를 맞추기
	 단, Yes 아니면 No만 답변 가능
	 +

	 순차 검색
	 1+ 2 + ... + n / n

	 맞출수 있는 확률: 2분의 n+1
	 5번은 시도해야 맞춤

	 반절 구분 방식
	 1,2,3,4,.... n

	 맞출수 있는 확률: 2의 k승
	 k = log2의 n승

	 시간복잡도, 공간복잡도
*/
}